public class Exam1 {
    public static void main(String[] args) {
        System.out.println();
        //===========================================================================================================
        // 문제1
        int num1 = 15;
        int num2 = 4;

        System.out.printf("num1을 num2로 나눈 몫은 %f입니다.\n", (double)num1 / num2); // num1을 num2로 나눈 몫은 3.750000입니다.
        System.out.println();
        //===========================================================================================================
        // 문제2(변수 활용 해야 답 인정)
        int a1 = 10;
        int a2 = a1;
        System.out.printf("a2는 a1과 같은 값 %d입니다.\n", a2); // 출력 : a2는 a1과 같은 값 10입니다.
        //===========================================================================================================
        // 문제3
        // 출력
        // 5
        // 4
        // 3
        // 2
        // 1
        System.out.println();
        for (int num = 5; num >=1; num--) {
            System.out.println(num);
        }
        //===========================================================================================================
        // 문제4(변수 활용 해야 답 인정) -> 출력문과 동일하지 않으면 정답 X
        System.out.println();

        String str1 = "hello";
        String str2 = "world";
        System.out.println(str1 + ", " + str2); // hello, world
        //===========================================================================================================
        // 문제 5
        System.out.println();
        int num = 10;
        if (num < 10) {
            System.out.println("10보다 작다");
        } else if (num >= 10) {
            System.out.println("10보다 크거나 같다");
        }
        // 10보다 크거나 같다.

        //===========================================================================================================
        // 문제6
        System.out.println();
        float[] arr = {1,2,3,4,5,6,7,8,9,10};
        System.out.println(arr.length); // 10

        //===========================================================================================================
        // 문제7
        System.out.println();
        Dog dog1 = new Dog(5,"Max");
        System.out.printf("%d살 강아지 %s\n", dog1.age, dog1.name); //출력: 5살 강아지 Max

        //===========================================================================================================
        // 문제8 -> 빈칸은 class에 있습니다.
        dog1.classInfo(); // 출력 : 이름과 나이를 이용해 Dog를 만드는 Exam.Dog class 입니다.

        //===========================================================================================================
        // 문제 10
        dog1.bark(); // 출력: Max가 멍멍하고 짖습니다.
        //===========================================================================================================


    }
}
//===========================================================================================================
class Dog {

    public int age;
    public String name;

    // 문제 9
    Dog(int age, String name) {
        this.age = age;
        this.name = name;
    }
    // 생성자

    // 문제 8
    void classInfo() {
        System.out.println("이름과 나이를 이용해 Dog를 만드는 Exam.Dog class 입니다.");
    }

    void bark() {
        System.out.printf("%s가 멍멍하고 짖습니다.\n", this.name);
    }
}